---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricArea.GetFabricSheetElementIds
source: html/7c1f56f7-0dd8-d0b6-c49e-b70c3e34bafd.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.GetFabricSheetElementIds Method

Retrieves the identifiers of all the FabricSheet Elements in the FabricArea.

## Syntax (C#)
```csharp
public IList<ElementId> GetFabricSheetElementIds()
```

## Returns
A collection of ElementIds of FabricSheet elements.